Autodesk.Revit.DB.IFC.IFCExtrusionAxes
Represents the possible axes to try when generating an extrusion using IFCCreateExtrusionData.
Since:
2012

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryXYZAndCustom
The x-, y-, and z-axes, and a custom direction.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryCustom
A custom direction.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryXYZ
The x-, y-, and z-axes.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryYZ
The y- and z-axes.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryXZ
The x- and z-axes.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryZ
The z-axis.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryXY
The x- and y-axes.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryY
The y-axis.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryX
The x-axis.

Autodesk.Revit.DB.IFC.IFCExtrusionAxes.TryDefault
The default value.